{
    "movies": [
      {
        "id": 1,
        "imageUrl": "https://upload.wikimedia.org/wikipedia/en/a/a7/BrightPoster.jpeg",
        "title": "Bright",
        "director": "David Ayer",
        "releaseYear": 2017,
        "durationMinutes": 117,
        "genres": ["Action", "Fantasy"],
        "description": "In an alternate interpretation of contemporary Los Angeles where creatures of fantasy such as Orcs, Elves and Fairies coexist with the human race, an already frail equilibrium between species is threatened when the seasoned police officer, Daryl Ward, partners up with the rookie cop and the first Orc to join in the force, Nick Jacoby. Under those circumstances",
        "bimage": "https://upload.wikimedia.org/wikipedia/en/a/a7/BrightPoster.jpeg"
      },
      {
        "id": 2,
        "imageUrl": "https://upload.wikimedia.org/wikipedia/en/b/bd/Tomb_Raider_%282018_film%29.png",
        "title": "Tomb Raider ",
        "director": "Roar Uthaug",
        "releaseYear": 2018,
        "durationMinutes": 119,
        "genres": ["Action", "Adventure"],
        "description": "Tomb Raider is a 2018 action-adventure film directed by Roar Uthaug, with a screenplay by Geneva Robertson-Dworet and Alastair Siddons, from a story by Evan Daugherty and Robertson-Dworet. An American and British co-production, it is based on the 2013 video game of the same name, with some elements of its sequel by Crystal Dynamics, a reboot, and the third installment in the Tomb Raider film series. The film stars Alicia Vikander as Lara Croft, who embarks on a perilous journey to her father's last-known destination, hoping to solve the mystery of his disappearance. Dominic West, Walton Goggins, Daniel Wu, and Kristin Scott Thomas appear in supporting roles",
        "bimage" : "https://upload.wikimedia.org/wikipedia/en/b/bd/Tomb_Raider_%282018_film%29.png"
      },
      {
        "id": 3,
        "imageUrl": "https://upload.wikimedia.org/wikipedia/en/4/45/QueenMoviePoster7thMarch.jpg",
        "title": "Queen",
        "director": "Vikash Bahl",
        "releaseYear": 2013,
        "durationMinutes": 146,
        "genres": ["Comedy", "Adventure"],
        "description": "Queen is a 2013 Indian Hindi-language comedy-drama film directed by Vikas Bahl and produced by Anurag Kashyap, Vikramaditya Motwane, and Madhu Mantena. The film stars Kangana Ranaut in the lead role, with Lisa Haydon and Rajkummar Rao playing supporting roles.[4] The film follows the story of Rani Mehra, a diffident Punjabi girl from New Delhi who embarks on her honeymoon to Paris and Amsterdam by herself after her fiancé calls off their weddin",
        "bimage" : "https://upload.wikimedia.org/wikipedia/en/4/45/QueenMoviePoster7thMarch.jpg"
      }
      
    ]
  }
  